// 1)რა განსხვავებაა let, const შორის?
// let keyword-ით ცვლადის შექმნის დროს შესაძლებლობა გვაქვს მას მნიშვნელობა გადავაწეროთ
// const keyword-ით ცვლადის შექმნის შემთხვევაში კი მისი მნიშვნელობა შეუცვლელია (constant). შეცვლის მცდელობა იწვევს ერორს.

// 2)რა განსხვავებაა primitive და nonprimitive type-ებს შორის?
// Primitive ტიპი არის უცვლელი (Immutable). მათი შეცვლა შუზლებელია, რადგან პროგრამას ჩვენს მეხსიერებაში პრიმიტიული ტიპის მისამართთან წვდომა არ აქვს. მათი მნიშვნელობა პირდაპირ იწერება Memory stack-ში.
// Non-primitive ტიპის შეცვლა კი უპრობლემოდაა შესაძლებელი. თავად დიდი ობიექტი ან მასივი ინახება Memory Heap-ში, ხოლო Stack-ში ინახება მხოლოდ მისამართი (Reference), თუ სად დევს ეს ობიექტი ჰიპში.

// 3)რა განსხვავებაა == და === ოპერატორებს შორის?
// == ამოწმებს მხოლოდ მონაცემს, === ამოწმებს როგორც მონაცემს, ასევე მონაცემის ტიპს. 

// 4)რა ტიპის არის null
// null არის ობიექტის ტიპის მონაცემი.

// 5)რა განსხვავებაა funtion და = () => {} შორის
// function keyword-ით ფუნქციის შექმნის დროს იგი არის local scope, ხოლო = () => არის global scope. ერორებისგან ტავის არიდების მიზნით უმჯბესია function-ით ვწეროთ ფუნქციები.

// 6)რას ნიშნავს callback function?
// callback-ი არის ისეთი ფუნქცია რომელიც სხვა ფუნქციას არგუმენტად გადაეცემა, ან სხვა ფუნქცია აბრუნებს მას.

// 7)რა განსხვავებაა map, filter და reduce-ს შორის?
// map გამოიყენება იმისთვის, რომ array-ის თითოეულ ელემენტს მივწვდეთ და შევცვალოთ, ისე რომ მან ახალი და updated array დაგვიბრუნოს.
// filter გადაუვლის array-ს და კონკრეტული პირობის მიხედვიტ გაფილტრავს array-ს ელემენტებს. ისიც ახალ მასივს აბრუნებს.
// reduce ს ვიყენებთ, რომ array-ს ელემენტები ერთ კონკრეტულ დონეზე დასვიყვანოთ. მაგ. დავაჯამოთ და რიცხვის სახით დავაბრუნოთ პასუხი.

// 8)რა არის Promise?
// Promise-ი არის ასინქრონული ობიექტი, რომელსაც აქვს ორი სესაძლო შემთხვევა: იგი ან წარმატებით სრულდება (resolve/fulfill) ან failed-ება (reject)

// 9)რა განსხვავებაა Promise.all, Promise.race და Promise.any-ს შორის?
// Promise.all => ეშვება მხოლოდ მაშინ, როდესაც ყველა Promise წარმატებით გაეშვება. სხვა შემთხვევაში ჩავარდება.
// Promise.race() => დაგვიბრუნებს promise-ს, რომელიც ყველაზე სწრაფად გაეშვება.
// Promise.any() => ელოდება პირველ წარმატებულ promise-ს.

// 10)რას ნიშნავს async/await და რატომ ვიყენებთ?
// async-ს ვიყენებთ, რომ კონკრეტული მიდინარე პროცესი ასინქრონული გავხადოთ. ეს შესაძლოა საწირო გახდეს, ვინაიდან JavaScript-ი Single thread ენაა რამოდენიმე პროცესის გაშვება სინქრონულად არ შეუძლია. იმისთვის, რომ დინება არ შევაფერხოთ შეგვიძლია async keyword-ი გამოვიყენოთ. 
// await-ი მხოლოდ და მხოლოდ ასინქრონულ ფუნქციებთან გამოიყენება. იგი ეუბნება პროგრამას, რომ დაელოდოს response-ს და არ განაგრძოს სანამ პასუხი არ დაუბრუნდება.

// 11)რა განსხვავებაა class-სა და object-ს შორის?
// კლასი არის კონკრეტული ელემენტის blueprint-ი, ობიექტი კი კლასის ინსტანცსია. ჩავთვალოთ რომ კლასის მეშვეობიტ წინასწარ ვწერთ გეგმას, ობიექტით კი შემდეგ ვანხორციელებთ მას.

// 12)რას აკეთებს constructor class-ში?
// კლასში constructor-ი ობიექტის საწყისი თვისებების (ცვლადების) ინიციალიზაციას ახდენს.

// 13)რა განსხვავებაა მემორი ჰიპსა და მემორი სტექკს შორის
// Memory Stack-ში ძირითადად პრიმიტიული ტიპის მონაცემები და ობიექტთა მისამართები ინახება. იგი შედარებით სწრაფია, თუმცა შეზღუდული ზომა აქვს.
// Memory Heap-ი არის უფრო დიდი მეხსიერების სივრცე. მასში ინახება კომპლექსური მონაცემები: arrays, objs, functions. მათი ზომა წინასწარ უცნობია და შეიძლება დინამიურად გაიზარდოს.

// 14)რა არის ქოლსტეკი
// Call stack მიჰყვება First in, last out პრინციპს. იგი არის მექანიზმი, რომლითაც JavaScript-ის ძრავი ადევნებს თვალყურს, თუ რომელი ფუნქცია სრულდება მოცემულ მომენტში და საიდან იქნა იგი გამოზახებული.

// 15)რა არის ივენთ ლუპი
// Event Loop არის მექანიზმი JavaScript-ში, რომელიც ერთმანეთთან აკავშირებს  Call Stack-ს და Callback Queue-ს. იგი უზრუნველყოფს პროგრამის გაშვებისას ყველა პროცესის შესაბამისად გადანაწილებას, იქნება ეს სინქრონული თუ ასინქრონული კოდი.
